Repository: ibrahim-s/emulateNumpadMode
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, pt, tr

source: Normal Mode
ar: الوضع العادي
pt: Modo normal
tr: Normal Mod

source: Numpad Mode
ar: وضع numpad
pt: Modo bloco numérico
tr: Dolaşma Modu

source: Numbers Mode
ar: وضع الأرقام
pt: Modo Números
tr: Sayısal Mod

source: Emulate a number key press.
ar: تقليد مفاتيح الأرقام
pt: Emular a tecla numpad.
tr: Bir sayı tuşuna basmayı taklit edin.

source: Navigate the numpad way
ar: التصفح بطريقةْ لوحةْ الأرقام
tr: Sayısal tuş takımı ile dolaşma

source: Form1
ar: الشكل الأول
pt: Formulário 1

source: Form2
ar: الشكل الثاني
pt: Formulário 2

source: Form3
ar: الشكل الثالث
pt: Formulário3

source: Form4
ar: الشكل الرابع

source: Choose form to emulate to numpad mode:
ar: اختر الشكل لتقليد نمط نَمّبَاد
pt: Escolha a forma para emular para o modo bloco numérico:
tr: Sayısal Tuş takımı modunda taklit edilecek formu seçin:

source: Selected Form
ar: الشكل المُحدد
pt: Formulário selecionado
tr: Seçili Form

source: Skip numbers mode
ar: تَخَطي وضع الأرقام
tr: Sayısal modu atla

source: Skip numpad mode
ar: تَخَطي وضع numpad
tr: Dolaşma modunu atla

source: Don't skip(Keep both modes)
ar: لا تُلغي أي وضع(الإبقاء على الوضعين)
tr: Hiçbirini atlama(Her iki modu da koru)

source: Skip Options:
ar: خَيارات التخَطي
tr: Atlama seçenekleri:

source: Dismiss numpadMode by escape key
ar: الخروج مِن نَمط نَمّبَاد بمفتاح الهروب
pt: Rejeitar o bloco numérico por tecla de escape
tr: Escape tuşuyla Sayısal tuş takımı modunu kapat

source: You can use up and down arrows to view the form
ar: تستطيع استخدام السهم الأعلى و الأسفل للإطِّلاع على الشكل
pt: Você pode usar setas para cima e para baixo para ver o formulário
tr: Formu görüntülemek için yukarı ve aşağı okları kullanabilirsiniz

source: Navigate The Numpad Way
ar: التصفح بطريقةْ لوحةْ الأرقام
tr: Sayısal tuş takımı ile dolaşma

source: Emulate numpad keys commands or navigation feature on a portion of the main keyboard. You can choose this portion or field, from the setting dialog of the addon. Default shortcut to toggle between normal and numpad mode in the addon is Shift+NVDA+F4, and you can modify it from input gestures dialog in NVDA.
ar: محاكاة أوامر المفاتيح الرقمية أو ميزة التنقل على جزء من لوحة المفاتيح الرئيسية. يمكنك اختيار هذا الجزء أو الحقل من مربع حوار الإعداد الخاص بالإضافة. الاختصار الافتراضي للتبديل بين الوضع العادي ووضع اللوحة الرقمية في الإضافة هو Shift+NVDA+F4، ويمكنك تعديله من مربع حوار تخصيص اختصارات NVDA.
tr: Ana klavyenin bir kısmında. Sayısal tuş takımı komutlarını veya dolaşma özelliğini taklit edin Bu kısmı veya alanı eklentinin ayarlar iletişim kutusundan seçebilirsiniz. Eklentide normal ve sayısal tuş takımı modu arasında geçiş yapmak için varsayılan kısayol Shift+NVDA+F4'tür. Bunu NVDA'daki girdi hareketleri iletişim kutusundan değiştirebilirsiniz.

source: Emulate numpad key commands.
tr: Sayısal tuş takımı komutlarını taklit eder.

source: Toggle between normal, emulated numpad mode and numbers mode states.
pt: Alternar entre o modo normal, bloco numérico emulado e os estados de modo numérico.
tr: Normal, Dolaşma ve Sayısal tuş takımını taklit etme modları arasında geçiş yapar.

source: Emulate numpad key press.
pt: Emular a tecla numpad.

source: Emulate Numpad Mode
pt: Modo Emular bloco numérico

source: Skipt numbers mode
pt: Modo saltar números

source: Emulate numpad key navigation feature on a portion of the main keyboard. Default shortcut to toggle between normal and numpad mode in the addon is NVDA+F4, and you can modify it from input gestures dialog in NVDA.
pt: Emular o recurso de navegação com teclado numérico numa parte do teclado principal. O atalho padrão para alternar entre o modo normal e o numérico no extra é NVDA+F4, e pode modificá-lo a partir do diálogo de entrada de comandos, no menu do NVDA.
